public class Main {
    public static void main(String[] args) {

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли
        int amount = 100;
        int mile = 20;
        boolean hasMile = true;
        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
        int bonus = amount / mile;
        System.out.println("Количество бонусных миль: " + bonus);
    }
}

